{
  "name": "Nonthachai Phosri",
  "home": {
    "text": "Home",
    "welcome": "Welcome to my portfolio!",
    "description": "Hello🙏, my name is Nonthachai Phosri. I am a software developer with experience in developing fullstack web applications using React, Vue, Nuxt3, Node.js, and MySQL. I can develop and maintain both frontend and backend parts and am committed to learning new technologies to develop efficient applications that meet user needs. I hope to bring my skills to benefit your organization. 🎉"
  },
  "project": {
    "text": "Projects",
    "title": "My Projects",
    "description": "Here are some of the projects I have worked on.",
    "view": "View project",
    "viewGitHub": "View project on GitHub",
    "projectOne": {
      "title": "Graduation Project",
      "description": "Graduation project at RMUTI CPE (64241A) – Market Stall Booking System",
      "detail": "Developed using HTML, CSS, JavaScript, and PHP (no frameworks). Integrated with APIs and a database, including login functionality and features for booking market stall spaces."
    },
    "projectTwo": {
      "title": "Internship Project",
      "description": "Internal project management system for an organization",
      "detail": "Frontend developed with Nuxt 3, Vue.js, and Vuetify. Backend built with Node.js, Express, and MySQL. Includes user authentication and multiple modules to manage internal projects."
    },
    "projectThree": {
      "title": "Skill Practice Project During Job Search (Built-in Company)",
      "description": "Inventory management system for a built-in furniture company",
      "detail": "Frontend developed with Next.js and React using Material UI. Backend built with Node.js, Express, and MySQL. Features authentication and various modules for inventory management. Took on a Fullstack role as well as BA/SA responsibilities, coordinating with the company, scheduling meetings, and presenting the project with a 4-person team. The project was well-received by the management, but could not proceed due to contract agreement issues."
    },
    "projectFour": {
      "title": "Skill Practice Project During Job Search (Secondhand Stock Management)",
      "description": "Inventory management system for secondhand products",
      "detail": "Frontend developed with Vue and Vuetify. Backend built with Node.js, Express, and MySQL using Sequelize ORM. Includes authentication and complete stock management functionality. Took full responsibility as a Fullstack developer, building the entire system independently."
    }
  },
  "skills": {
    "text": "Skills",
    "title": "My Skills",
    "programmingLanguages": "Programming Languages",
    "tools": "Tools",
    "frameworks": "Frameworks"
  },
  "aboutme": {
    "title": "About Me",
    "tel": "Telephone",
    "email": "Email",
    "facebook": "Facebook",
    "line": "Line",
    "github": "GitHub",
    "cv": "CV"
  },
  "footer": {
    "copyright": "© 2025 Nonthachai. All rights reserved."
  }
}
